Рабочая.Задачи2/src/InformationRegisters/ЦБР_СтартОтказОтЗадач/ЦБР_СтартОтказОтЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦБР_СтартОтказОтЗадач</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ПринятоВРаботу</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ПричинаОтказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>CatalogRef.ЦБР_Задача</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Куратор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Рабочая.Задачи2/src/Enums/ЦБР_Состояние/ЦБР_Состояние.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЦБР_Состояние</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>ГотовКСдаче</name>
  </enumValues>
  <enumValues>
    <name>Запланировано</name>
  </enumValues>
  <enumValues>
    <name>ЗапросИнформации</name>
  </enumValues>
  <enumValues>
    <name>НаСогласовании</name>
  </enumValues>
  <enumValues>
    <name>НаТестировании</name>
  </enumValues>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
  <enumValues>
    <name>ПринятьЗадачу</name>
  </enumValues>
  <enumValues>
    <name>Приостановлен</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>УточнениеТребований</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

Рабочая.Задачи2/src/Enums/ЦБР_РольВЗадаче/ЦБР_РольВЗадаче.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЦБР_РольВЗадаче</name>
  <enumValues>
    <name>Постановщик</name>
  </enumValues>
  <enumValues>
    <name>Наблюдатель</name>
  </enumValues>
  <enumValues>
    <name>Исполнитель</name>
  </enumValues>
  <enumValues>
    <name>КураторИсполнителя</name>
  </enumValues>
  <enumValues>
    <name>КураторПостановщика</name>
  </enumValues>
  <enumValues>
    <name>ВладелецЗадачи</name>
  </enumValues>
  <enumValues>
    <name>ИсполнительРазработчик</name>
  </enumValues>
  <enumValues>
    <name>ИсполнительАналитик</name>
  </enumValues>
</mdclass:Enum>

Рабочая.Задачи2/src/Catalogs/ЦБР_ГруппыСотрудников/ЦБР_ГруппыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЦБР_ГруппыСотрудников</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Недействителен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Разработчик</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитик</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Рабочая.Задачи2/src/CommonModules/ЦБР_КэшированиеВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

#Область СменаСтатусов

Функция ПолучитьПриоритетностьСтатусовЗаданий() Экспорт
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(Неопределено, 9999);    
	Соответствие.Вставить(Перечисления.ЦБР_Состояние.ПустаяСсылка(), 9999);
	
	//Соответствие.Вставить(Перечисления.ЦБР_Состояние.НаСогласованииСроков, 1);
	//Соответствие.Вставить(Перечисления.ЦБР_Состояние.НаСогласованииОценки, 1);
	Соответствие.Вставить(Перечисления.ЦБР_Состояние.НаСогласовании, 1);

	//Соответствие.Вставить(Перечисления.ЦБР_Состояние.Запланировано, 2);

	//Соответствие.Вставить(Перечисления.ЦБР_Состояние.НаТестировании, 3);
	Соответствие.Вставить(Перечисления.ЦБР_Состояние.ВРаботе, 3);
	Соответствие.Вставить(Перечисления.ЦБР_Состояние.ЗапросИнформации, 3);
	//Соответствие.Вставить(Перечисления.ЦБР_Состояние.Приостановлен, 3);
	//Соответствие.Вставить(Перечисления.ЦБР_Состояние.УточнениеТребований, 3);

	Соответствие.Вставить(Перечисления.ЦБР_Состояние.Согласован, 4);
	//Соответствие.Вставить(Перечисления.ЦБР_Состояние.СрокиСогласованы, 4);
	//Соответствие.Вставить(Перечисления.ЦБР_Состояние.ОценкаСогласована, 4);
	
	//Соответствие.Вставить(Перечисления.ЦБР_Состояние.Отменен, 8); 

	//Соответствие.Вставить(Перечисления.ЦБР_Состояние.СрокиНеСогласованы, 9);
	//Соответствие.Вставить(Перечисления.ЦБР_Состояние.ОценкаНеСогласована, 9);
	Соответствие.Вставить(Перечисления.ЦБР_Состояние.НеСогласован, 9);
	
	Соответствие.Вставить(Перечисления.ЦБР_Состояние.Выполнен, 10); 
	Соответствие.Вставить(Перечисления.ЦБР_Состояние.Закрыт, 11); 
	Соответствие.Вставить(Перечисления.ЦБР_Состояние.Черновик, 9999);
	
	Возврат Соответствие;  
	
КонецФункции

Функция ПолучитьСответствиеПриоритетаСтатусу() Экспорт 
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(1, Перечисления.ЦБР_Состояние.НаСогласовании);
	//Соответствие.Вставить(2, Перечисления.ЦБР_Состояние.Запланировано);
	Соответствие.Вставить(3, Перечисления.ЦБР_Состояние.ВРаботе);
	Соответствие.Вставить(4, Перечисления.ЦБР_Состояние.Согласован);
	//Соответствие.Вставить(5, Перечисления.ЦБР_Состояние.Приостановлен);
	Соответствие.Вставить(6, Перечисления.ЦБР_Состояние.Новый);
	//Соответствие.Вставить(7, Перечисления.ЦБР_Состояние.ГотовКСдаче);
	Соответствие.Вставить(8, Перечисления.ЦБР_Состояние.Отменен);
	Соответствие.Вставить(9, Перечисления.ЦБР_Состояние.НеСогласован); 
	//Соответствие.Вставить(10, Перечисления.ЦБР_Состояние.Приостановлен);
	Соответствие.Вставить(11, Перечисления.ЦБР_Состояние.Выполнен); 
	Соответствие.Вставить(12, Перечисления.ЦБР_Состояние.Закрыт); 
	Соответствие.Вставить(9999, Перечисления.ЦБР_Состояние.Новый);
	
	Возврат Соответствие; 
	
КонецФункции

#КонецОбласти

#Область Обсуждения

// Соответствие уведомлений событиям.
// 
// Возвращаемое значение:
//  Соответствие - Соответствие - Соответствие из структур уведомлений
//
Функция СоответствиеУведомленийСобытиям() Экспорт
	
	Соответствие = Новый Соответствие;	
	//Старт
	СтруктураУведомления = ПолучитьСтруктуруУведомления();
	СтруктураУведомления.Вставить("Заголовок","Задача взята в работу.");
	СтруктураУведомления.Вставить("ЕстьДетализация",Ложь);
	Соответствие.Вставить("Старт", СтруктураУведомления);	
	//Уведомление
	СтруктураУведомления = ПолучитьСтруктуруУведомления();
	СтруктураУведомления.Вставить("Заголовок","Обрати внимание!");
	СтруктураУведомления.Вставить("ЕстьДетализация",Ложь);
	Соответствие.Вставить("Уведомление", СтруктураУведомления);	
	//Перевод
	СтруктураУведомления = ПолучитьСтруктуруУведомления();
	СтруктураУведомления.Вставить("Заголовок","На вас перевели задачу.");
	СтруктураУведомления.Вставить("ЕстьДетализация",Ложь);
	Соответствие.Вставить("Перевод", СтруктураУведомления);	
	//Отказ
	СтруктураУведомления = ПолучитьСтруктуруУведомления();
	СтруктураУведомления.Вставить("Заголовок","Задача отклонена");
	СтруктураУведомления.Вставить("ПередДопИнформацией","Причина :");
	СтруктураУведомления.Вставить("ЦветЗаголовка",ЦветаСтиля.ДосьеПлохаяОценкаЦвет);
	Соответствие.Вставить("Отказ", СтруктураУведомления);
	//Назначение исполнителя
	СтруктураУведомления = ПолучитьСтруктуруУведомления();
	СтруктураУведомления.Вставить("Заголовок","Вы назначены исполнителем по задаче.");
	СтруктураУведомления.Вставить("ЕстьДетализация",Ложь);
	Соответствие.Вставить("НазначениеИсполнителя", СтруктураУведомления);
	//Удаление исполнителя
	СтруктураУведомления = ПолучитьСтруктуруУведомления();
	СтруктураУведомления.Вставить("Заголовок","Вы удалены из задачи.");
	СтруктураУведомления.Вставить("ЕстьДетализация",Ложь);
	Соответствие.Вставить("УдалениеИсполнителя", СтруктураУведомления);    
	//Назначение аналитика
	СтруктураУведомления = ПолучитьСтруктуруУведомления();
	СтруктураУведомления.Вставить("Заголовок","Вы назначены аналитиком по заданию.");
	СтруктураУведомления.Вставить("ЕстьДетализация",Ложь);
	Соответствие.Вставить("НазначениеАналитика", СтруктураУведомления);
	//Назначение куратора
	СтруктураУведомления = ПолучитьСтруктуруУведомления();
	СтруктураУведомления.Вставить("Заголовок","Вы назначены куратором задачи.");
	СтруктураУведомления.Вставить("ЕстьДетализация",Ложь);
	Соответствие.Вставить("СменаКуратора", СтруктураУведомления);
	//Запрос информации
	СтруктураУведомления = ПолучитьСтруктуруУведомления();
	СтруктураУведомления.Вставить("Заголовок","Запрос информации:");
	СтруктураУведомления.Вставить("ПередДопИнформацией","");
	Соответствие.Вставить("ЗапросИнформации", СтруктураУведомления);
	//ОтменаЗапросаИнформации
	СтруктураУведомления = ПолучитьСтруктуруУведомления();
	СтруктураУведомления.Вставить("Заголовок","Отмена запроса информации:");
	СтруктураУведомления.Вставить("ПередДопИнформацией","");
	СтруктураУведомления.Вставить("ЦветЗаголовка",ЦветаСтиля.ДосьеПлохаяОценкаЦвет);
	Соответствие.Вставить("ОтменаЗапросаИнформации", СтруктураУведомления);
	//Ответ
	СтруктураУведомления = ПолучитьСтруктуруУведомления();
	СтруктураУведомления.Вставить("Заголовок","Ответ:");
	СтруктураУведомления.Вставить("ПередДопИнформацией","");
	Соответствие.Вставить("ОтветНаЗапрос", СтруктураУведомления);
	//Согласование	
	СтруктураУведомления = ПолучитьСтруктуруУведомления();	
	СтруктураУведомления.Вставить("Заголовок","Запрос на согласование оценки.");
	Соответствие.Вставить("СогласованиеОценки", СтруктураУведомления);
	
	СтруктураУведомления = ПолучитьСтруктуруУведомления();
	СтруктураУведомления.Вставить("Заголовок","Запрос на согласование сроков.");	
	Соответствие.Вставить("СогласованиеСроков", СтруктураУведомления);
	
	СтруктураУведомления = ПолучитьСтруктуруУведомления();
	СтруктураУведомления.Вставить("Заголовок","Оценка согласована.");
	СтруктураУведомления.Вставить("ЦветЗаголовка",ЦветаСтиля.ЦветТекстаУспех);	
	Соответствие.Вставить("СогласоватьОценку", СтруктураУведомления);
	
	СтруктураУведомления = ПолучитьСтруктуруУведомления();
	СтруктураУведомления.Вставить("Заголовок","Сроки согласованы.");
	СтруктураУведомления.Вставить("ЦветЗаголовка",ЦветаСтиля.ЦветТекстаУспех);
	Соответствие.Вставить("СогласоватьСроки", СтруктураУведомления);
	
	СтруктураУведомления = ПолучитьСтруктуруУведомления();
	СтруктураУведомления.Вставить("Заголовок","Оценка не согласована.");      
	СтруктураУведомления.Вставить("ЦветЗаголовка",ЦветаСтиля.ДосьеПлохаяОценкаЦвет);	
	Соответствие.Вставить("ОтклонитьОценку", СтруктураУведомления);
	
	СтруктураУведомления = ПолучитьСтруктуруУведомления();
	СтруктураУведомления.Вставить("Заголовок", "Сроки не согласованы.");
	СтруктураУведомления.Вставить("ЦветЗаголовка", ЦветаСтиля.ДосьеПлохаяОценкаЦвет);
	Соответствие.Вставить("ОтклонитьСроки", СтруктураУведомления);
	
	//Пересогласование	
	СтруктураУведомления = ПолучитьСтруктуруУведомления();	
	СтруктураУведомления.Вставить("Заголовок","Запрос на пересогласование оценки.");
	Соответствие.Вставить("ПересогласованиеОценки", СтруктураУведомления);
	
	//РезультатОС
	СтруктураУведомления = ПолучитьСтруктуруУведомления();
	СтруктураУведомления.Вставить("Заголовок", "Результат действия:");
	СтруктураУведомления.Вставить("ПередДопИнформацией", "");
	Соответствие.Вставить("РезультатОС", СтруктураУведомления);
	//ПричинаИзмененияОС
	СтруктураУведомления = ПолучитьСтруктуруУведомления();
	СтруктураУведомления.Вставить("Заголовок", "Изменен календарь:");
	СтруктураУведомления.Вставить("ПередДопИнформацией", "");
	Соответствие.Вставить("ПричинаИзмененияОС", СтруктураУведомления);
	
	//НовоеДействиеОС
	СтруктураУведомления = ПолучитьСтруктуруУведомления();
	СтруктураУведомления.Вставить("Заголовок", "Новое действие по задаче:");
	СтруктураУведомления.Вставить("ПередДопИнформацией", "");
	Соответствие.Вставить("НовоеДействиеОС", СтруктураУведомления);
	
	//ДатаОтветаНаЗапрос
	СтруктураУведомления = ПолучитьСтруктуруУведомления();
	СтруктураУведомления.Вставить("Заголовок", "Дата ответа на запрос:");
	СтруктураУведомления.Вставить("ПередДопИнформацией", "");
	СтруктураУведомления.Вставить("ЦветЗаголовка",ЦветаСтиля.ДосьеПлохаяОценкаЦвет);
	Соответствие.Вставить("ДатаОтветаНаЗапрос", СтруктураУведомления);	
	
	//ЗакрытиеЗадачи
	СтруктураУведомления = ПолучитьСтруктуруУведомления();
	СтруктураУведомления.Вставить("Заголовок","Задача закрыта");
	СтруктураУведомления.Вставить("ЕстьДетализация",Ложь);
	Соответствие.Вставить("ЗакрытиеЗадачи", СтруктураУведомления);
	
	//ОтменаЗакрытияЗадачи
	СтруктураУведомления = ПолучитьСтруктуруУведомления();
	СтруктураУведомления.Вставить("Заголовок","Задача реанимирована");
	СтруктураУведомления.Вставить("ЕстьДетализация",Ложь);
	Соответствие.Вставить("ОтменаЗакрытияЗадачи", СтруктураУведомления);
	
	//РазделениеЗадания
	СтруктураУведомления = ПолучитьСтруктуруУведомления();
	СтруктураУведомления.Вставить("Заголовок", "Разделение задания:");
	СтруктураУведомления.Вставить("ПередДопИнформацией", "");
	Соответствие.Вставить("РазделениеЗадания", СтруктураУведомления);
	
	//ИзменениеОценки
	СтруктураУведомления = ПолучитьСтруктуруУведомления();
	СтруктураУведомления.Вставить("Заголовок", "Пересогласование оценки:");
	СтруктураУведомления.Вставить("ПередДопИнформацией", "");
	Соответствие.Вставить("ИзменениеОценки", СтруктураУведомления);
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти

#Область НастрокиРолей

// Возращает соответствие с настроками видимости и доступности по ролям.
// 
// Возвращаемое значение:
//  Соответствие - Настроки видимости доступности по ролям
Функция НастрокиВидимостиДоступностиПоРолям() Экспорт
	
	Соответствие = Новый Соответствие;
	//Постановщик	
	СтруктураНастройки = ПолучитьСтруктуруНастрокиВидимостиДоступностиПоРолям();	
	СтруктураНастройки.НастройкиВидимости.Булево.Вставить("ДобавитьСобытиеПоЗадаче",Ложь);
	СтруктураНастройки.НастройкиВидимости.Булево.Вставить("ДеревоЗадачДействияСЭтапами",Ложь);
	СтруктураНастройки.НастройкиВидимости.Булево.Вставить("ДобавитьИсполнителя",Ложь);
	СтруктураНастройки.НастройкиВидимости.Булево.Вставить("ФормаПеревестиЗадачу",Ложь);
	СтруктураНастройки.НастройкиВидимости.Булево.Вставить("ДеревоЗадачГруппа2",Ложь);
	СтруктураНастройки.НастройкиВидимости.Булево.Вставить("ДеревоЗадачСвязатьЗадачи",Ложь);
	СтруктураНастройки.НастройкиВидимости.Булево.Вставить("ДеревоЗадачГруппаКомандСогласование",Ложь);
//	СтруктураНастройки.НастройкиВидимости.Булево.Вставить("ФормаУточнение",Ложь);
	СтруктураНастройки.НастройкиВидимости.Булево.Вставить("ДеревоЗадачГруппаДобавить",Ложь);
	СтруктураНастройки.НастройкиВидимости.Булево.Вставить("ДеревоЗадачГруппаИзменениеПорядкаЗадач",Ложь);
	СтруктураНастройки.НастройкиВидимости.ПоУсловию.Вставить("ДеревоЗадачОтобразитьЭтапыНаСогласовании","СогласованиеЗаданий.Количество()");
	//СтруктураНастройки.НастройкиВидимости.ПоУсловию.Вставить("ПодтвердитьВыполнениеЗадачи", "Объект.СостояниеЗадачи = ПредопределенноеЗначение(""Перечисление.ЦБР_Состояние.ГотовКСдаче"")"); 
	//СтруктураНастройки.НастройкиВидимости.ПоУсловию.Вставить("ОтклонитьВыполнениеЗадачи", "Объект.СостояниеЗадачи = ПредопределенноеЗначение(""Перечисление.ЦБР_Состояние.ГотовКСдаче"")"); 
	СтруктураНастройки.НастройкиВидимости.ПоУсловию.Вставить("Группа3","Объект.СостояниеЗадачи = ПредопределенноеЗначение(""Перечисление.ЦБР_Состояние.Черновик"")");
	СтруктураНастройки.НастройкиВидимости.ПоУсловию.Удалить("ДобавитьИсполнителя");
	СтруктураНастройки.НастройкиВидимости.ПоУсловию.Удалить("ДобавитьСобытиеПоЗадаче");
	СтруктураНастройки.НастройкиВидимости.ПоУсловию.Удалить("ФормаПеревестиЗадачу");
	СтруктураНастройки.ТолькоПросмотр.Булево.Вставить("СтраницаОбзор", Ложь);
	СтруктураНастройки.ТолькоПросмотр.Булево.Вставить("СтраницаРеквизиты", Ложь);
	СтруктураНастройки.ТолькоПросмотр.Булево.Вставить("ДеревоЗадач", Истина);
	СтруктураНастройки.ТолькоПросмотр.ПоУсловию.Вставить("Группа2", "Объект.СостояниеЗадачи <> ПредопределенноеЗначение(""Перечисление.ЦБР_Состояние.Черновик"")");
	СтруктураНастройки.ТолькоПросмотр.ПоУсловию.Вставить("НаименованиеЗадачи", "Объект.СостояниеЗадачи <> ПредопределенноеЗначение(""Перечисление.ЦБР_Состояние.Черновик"")");
	Соответствие.Вставить(Перечисления.ЦБР_РольВЗадаче.Постановщик, СтруктураНастройки);	
	
	//Владелец	
	СтруктураНастройки = ПолучитьСтруктуруНастрокиВидимостиДоступностиПоРолям();	
	СтруктураНастройки.ТолькоПросмотр.Булево.Вставить("СтраницаОбзор", Ложь);
	СтруктураНастройки.ТолькоПросмотр.Булево.Вставить("СтраницаРеквизиты", Ложь);
	СтруктураНастройки.ТолькоПросмотр.ПоУсловию.Вставить("Группа2", "Объект.СостояниеЗадачи <> ПредопределенноеЗначение(""Перечисление.ЦБР_Состояние.Черновик"")");
	СтруктураНастройки.ТолькоПросмотр.ПоУсловию.Вставить("НаименованиеЗадачи", "Объект.СостояниеЗадачи <> ПредопределенноеЗначение(""Перечисление.ЦБР_Состояние.Черновик"")");
	СтруктураНастройки.НастройкиВидимости.Булево.Вставить("ФормаСтартовать",Истина);
	СтруктураНастройки.НастройкиВидимости.ПоУсловию.Вставить("ДеревоЗадачОтобразитьЭтапыНаСогласовании","СогласованиеЗаданий.Количество()");
	СтруктураНастройки.НастройкиВидимости.ПоУсловию.Вставить("Группа3","Объект.СостояниеЗадачи = ПредопределенноеЗначение(""Перечисление.ЦБР_Состояние.Черновик"")");
	СтруктураНастройки.НастройкиВидимости.Булево.Вставить("ОтклонитьЗадачу",Истина);
	СтруктураНастройки.НастройкиВидимости.ПоУсловию.Вставить("ФормаСтартовать","Не Объект.Стартовала И ПользователиКлиентСервер.ТекущийПользователь() = Объект.Куратор");
	СтруктураНастройки.НастройкиВидимости.ПоУсловию.Вставить("ОтклонитьЗадачу","Не Объект.Стартовала И ПользователиКлиентСервер.ТекущийПользователь() = Объект.Куратор");
	Соответствие.Вставить(Перечисления.ЦБР_РольВЗадаче.ВладелецЗадачи, СтруктураНастройки);	
	
	//Куратор исполнителя	
	СтруктураНастройки = ПолучитьСтруктуруНастрокиВидимостиДоступностиПоРолям();	
	СтруктураНастройки.НастройкиВидимости.ПоУсловию.Вставить("ФормаСтартовать","Не Объект.Стартовала И ПользователиКлиентСервер.ТекущийПользователь() = Объект.Куратор");
	СтруктураНастройки.НастройкиВидимости.ПоУсловию.Вставить("ОтклонитьЗадачу","Не Объект.Стартовала И ПользователиКлиентСервер.ТекущийПользователь() = Объект.Куратор");
	//СтруктураНастройки.НастройкиВидимости.ПоУсловию.Вставить("ДобавитьИсполнителя", Истина);
	Соответствие.Вставить(Перечисления.ЦБР_РольВЗадаче.КураторИсполнителя, СтруктураНастройки);
		
	//Куратор постановщика	
	СтруктураНастройки = ПолучитьСтруктуруНастрокиВидимостиДоступностиПоРолям();	
	СтруктураНастройки.НастройкиВидимости.Булево.Вставить("ДобавитьСобытиеПоЗадаче",Ложь);
	СтруктураНастройки.НастройкиВидимости.Булево.Вставить("ДеревоЗадачДействияСЭтапами",Ложь);
	СтруктураНастройки.НастройкиВидимости.Булево.Вставить("СменитьПостановщика",Истина);
	СтруктураНастройки.НастройкиВидимости.Булево.Вставить("ДобавитьИсполнителя",Ложь);
	СтруктураНастройки.НастройкиВидимости.Булево.Вставить("ФормаПеревестиЗадачу",Ложь);
	СтруктураНастройки.НастройкиВидимости.Булево.Вставить("ДеревоЗадачГруппа2",Ложь);
	СтруктураНастройки.НастройкиВидимости.Булево.Вставить("ДеревоЗадачСвязатьЗадачи",Ложь);
	СтруктураНастройки.НастройкиВидимости.Булево.Вставить("ДеревоЗадачГруппаКомандСогласование",Ложь);
//	СтруктураНастройки.НастройкиВидимости.Булево.Вставить("ФормаУточнение",Ложь);
	СтруктураНастройки.НастройкиВидимости.Булево.Вставить("ДеревоЗадачГруппаДобавить",Ложь);
	СтруктураНастройки.НастройкиВидимости.Булево.Вставить("ДеревоЗадачГруппаИзменениеПорядкаЗадач",Ложь);
	//СтруктураНастройки.НастройкиВидимости.ПоУсловию.Вставить("ПодтвердитьВыполнениеЗадачи", "Объект.СостояниеЗадачи = ПредопределенноеЗначение(""Перечисление.ЦБР_Состояние.ГотовКСдаче"")");
	//СтруктураНастройки.НастройкиВидимости.ПоУсловию.Вставить("ОтклонитьВыполнениеЗадачи", "Объект.СостояниеЗадачи = ПредопределенноеЗначение(""Перечисление.ЦБР_Состояние.ГотовКСдаче"")"); 
	СтруктураНастройки.НастройкиВидимости.ПоУсловию.Вставить("ДеревоЗадачОтобразитьЭтапыНаСогласовании","СогласованиеЗаданий.Количество()");
	СтруктураНастройки.НастройкиВидимости.ПоУсловию.Вставить("Группа3","Объект.СостояниеЗадачи = ПредопределенноеЗначение(""Перечисление.ЦБР_Состояние.Черновик"")");
	СтруктураНастройки.НастройкиВидимости.ПоУсловию.Удалить("ДобавитьИсполнителя");
	СтруктураНастройки.НастройкиВидимости.ПоУсловию.Удалить("ДобавитьСобытиеПоЗадаче");
	СтруктураНастройки.НастройкиВидимости.ПоУсловию.Удалить("ФормаПеревестиЗадачу");
	СтруктураНастройки.ТолькоПросмотр.Булево.Вставить("СтраницаОбзор", Ложь);
	СтруктураНастройки.ТолькоПросмотр.Булево.Вставить("СтраницаРеквизиты", Ложь);
	СтруктураНастройки.ТолькоПросмотр.Булево.Вставить("ДеревоЗадач", Истина);
	СтруктураНастройки.ТолькоПросмотр.ПоУсловию.Вставить("Группа2", "Объект.СостояниеЗадачи <> ПредопределенноеЗначение(""Перечисление.ЦБР_Состояние.Черновик"")");
	СтруктураНастройки.ТолькоПросмотр.ПоУсловию.Вставить("НаименованиеЗадачи", "Объект.СостояниеЗадачи <> ПредопределенноеЗначение(""Перечисление.ЦБР_Состояние.Черновик"")");
	Соответствие.Вставить(Перечисления.ЦБР_РольВЗадаче.КураторПостановщика, СтруктураНастройки);	
	
	//Исполнитель	
	СтруктураНастройки = ПолучитьСтруктуруНастрокиВидимостиДоступностиПоРолям();	
	Соответствие.Вставить(Перечисления.ЦБР_РольВЗадаче.Исполнитель, СтруктураНастройки);	
	
	//Разработчик	
	СтруктураНастройки = ПолучитьСтруктуруНастрокиВидимостиДоступностиПоРолям();	
	Соответствие.Вставить(Перечисления.ЦБР_РольВЗадаче.ИсполнительРазработчик, СтруктураНастройки);	
	
	//Аналитик	
	СтруктураНастройки = ПолучитьСтруктуруНастрокиВидимостиДоступностиПоРолям();	
	Соответствие.Вставить(Перечисления.ЦБР_РольВЗадаче.ИсполнительАналитик, СтруктураНастройки);	
	
	//Наблюдатель	
	СтруктураНастройки = ПолучитьСтруктуруНастрокиВидимостиДоступностиПоРолям();	
	СтруктураНастройки.НастройкиВидимости.Булево.Вставить("ДобавитьСобытиеПоЗадаче",Ложь);
	СтруктураНастройки.НастройкиВидимости.Булево.Вставить("ДеревоЗадачДействияСЭтапами",Ложь);
	СтруктураНастройки.НастройкиВидимости.Булево.Вставить("ДобавитьИсполнителя",Ложь);
	СтруктураНастройки.НастройкиВидимости.Булево.Вставить("ФормаПеревестиЗадачу",Ложь);
	СтруктураНастройки.НастройкиДоступности.Булево.Вставить("ДеревоЗадачДобавитьПодчиненную",Ложь);
	СтруктураНастройки.НастройкиДоступности.Булево.Вставить("ДеревоЗадачДобавитьПоследующую",Ложь);
	СтруктураНастройки.НастройкиДоступности.Булево.Вставить("ДеревоЗадачСвязатьЗадачи",Ложь);
	СтруктураНастройки.НастройкиДоступности.Булево.Вставить("ДеревоЗадачГруппаКомандСогласование",Ложь);
	СтруктураНастройки.ТолькоПросмотр.Булево.Вставить("ПланЗадачи", Истина);
	Соответствие.Вставить(Перечисления.ЦБР_РольВЗадаче.Наблюдатель, СтруктураНастройки);	
		
	Возврат Соответствие;
	
КонецФункции		

#КонецОбласти

#КонецОбласти

#Область СлужебныеФункцииИПроцедуры

#Область Обсуждения

// Возвращает структуру уведомления для обсуждения.
// 
// Возвращаемое значение:
//  Структура - Структура из:
//  Заголовок - Строка
//	ЦветЗаголовка - Цвет
//  ЕстьДетализация - Булево
//  ПередДопИнформацией - Строка
//
Функция ПолучитьСтруктуруУведомления()
	
	Структура = Новый Структура("Заголовок, ЦветЗаголовка, ЕстьДетализация, ПередДопИнформацией", "", ЦветаСтиля.ЦветГиперссылки, Истина, Символы.ПС+"Этап:");
	Возврат Структура;  
	
КонецФункции

#КонецОбласти

#Область НастрокиРолей

Функция ПолучитьСтруктуруНастрокиВидимостиДоступностиПоРолям()
	
	Структура = Новый Структура("НастройкиДоступности, НастройкиВидимости, ТолькоПросмотр", Новый Структура("Булево, ПоУсловию", Новый Структура, Новый Структура), Новый Структура("Булево, ПоУсловию", Новый Структура, Новый Структура), Новый Структура("Булево, ПоУсловию", Новый Структура, Новый Структура));
	
	Структура.НастройкиДоступности.Булево.Вставить("СменитьРуководителяЗадачи", Ложь);
	Структура.НастройкиВидимости.Булево.Вставить("ДеревоЗадачГруппа2", Истина);
	Структура.НастройкиВидимости.Булево.Вставить("ДеревоЗадачСвязатьЗадачи", Истина);
	Структура.НастройкиВидимости.Булево.Вставить("ДеревоЗадачГруппаКомандСогласование", Истина);
	Структура.НастройкиВидимости.Булево.Вставить("ДеревоЗадачОтобразитьЭтапыНаСогласовании", Ложь);
	//Структура.НастройкиВидимости.Булево.Вставить("ПодтвердитьВыполнениеЗадачи", Ложь);
	Структура.НастройкиВидимости.Булево.Вставить("ФормаСтартовать", Ложь);
	Структура.НастройкиВидимости.Булево.Вставить("ОтклонитьЗадачу", Ложь);
	Структура.НастройкиВидимости.Булево.Вставить("ДобавитьИсполнителя", Истина);
	Структура.НастройкиВидимости.Булево.Вставить("ФормаПеревестиЗадачу", Истина);
	Структура.НастройкиВидимости.Булево.Вставить("СменитьПостановщика", Ложь);
	Структура.НастройкиВидимости.Булево.Вставить("ДобавитьСобытиеПоЗадаче", Истина);
	Структура.НастройкиВидимости.Булево.Вставить("ДеревоЗадачДействияСЭтапами", Истина);
	
	Структура.ТолькоПросмотр.Булево.Вставить("СтраницаОбзор", Истина);	
	Структура.ТолькоПросмотр.Булево.Вставить("СтраницаРеквизиты", Истина);	
	Структура.ТолькоПросмотр.Булево.Вставить("ДеревоЗадач", Ложь);	
	Структура.ТолькоПросмотр.Булево.Вставить("РуководительЗадачи", Истина);	

	Структура.НастройкиВидимости.ПоУсловию.Вставить("ДеревоЗадачГруппаПлан", "Объект.КонтролироватьСроки");
	
//	Структура.НастройкиВидимости.ПоУсловию.Вставить("ДобавитьИсполнителя", "Объект.Стартовала");
//	Структура.НастройкиВидимости.ПоУсловию.Вставить("ФормаПеревестиЗадачу", "Объект.Стартовала");
//	Структура.НастройкиВидимости.ПоУсловию.Вставить("ДобавитьСобытиеПоЗадаче", "Объект.Стартовала");
//	Структура.НастройкиВидимости.ПоУсловию.Вставить("ФормаГруппа2", "Объект.Стартовала");
//	Структура.НастройкиВидимости.ПоУсловию.Вставить("ФормаУведомление", "Объект.Стартовала");
	Структура.НастройкиВидимости.ПоУсловию.Вставить("ДобавитьИсполнителя", "СтруктураДанныхДляНастроекВидимости.РуководительПринялЗадачу");
	Структура.НастройкиВидимости.ПоУсловию.Вставить("ФормаПеревестиЗадачу", "СтруктураДанныхДляНастроекВидимости.РуководительПринялЗадачу И СтруктураДанныхДляНастроекВидимости.ЭтоКураторМоегоНаправления");
	Структура.НастройкиВидимости.ПоУсловию.Вставить("ДобавитьСобытиеПоЗадаче", "СтруктураДанныхДляНастроекВидимости.РуководительПринялЗадачу");
	Структура.НастройкиВидимости.ПоУсловию.Вставить("ФормаГруппа2", "СтруктураДанныхДляНастроекВидимости.РуководительПринялЗадачу");
	Структура.НастройкиВидимости.ПоУсловию.Вставить("ФормаУведомление", "СтруктураДанныхДляНастроекВидимости.РуководительПринялЗадачу");
	Структура.НастройкиВидимости.ПоУсловию.Вставить("ГруппаЛегенда", "ОтображатьЛегенду");
	
	Возврат Структура;	
	
КонецФункции

Функция РуководительПринялЗадачу(Задача) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	Запрос.УстановитьПараметр("Задача", Задача);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦБР_ГруппыСотрудниковСостав.Ссылка.Руководитель КАК Руководитель,
	|	ЦБР_СтартОтказОтЗадачСрезПоследних.ПринятоВРаботу КАК ПринятоВРаботу
	|ИЗ
	|	Справочник.ЦБР_ГруппыСотрудников.Состав КАК ЦБР_ГруппыСотрудниковСостав
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦБР_СтартОтказОтЗадач.СрезПоследних(, Задача = &Задача) КАК
	|			ЦБР_СтартОтказОтЗадачСрезПоследних
	|		ПО (ЦБР_ГруппыСотрудниковСостав.Ссылка.Руководитель = ЦБР_СтартОтказОтЗадачСрезПоследних.Куратор)
	|ГДЕ
	|	ЦБР_ГруппыСотрудниковСостав.Пользователь = &Пользователь";

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ПринятоВРаботу) И Выборка.ПринятоВРаботу Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь; 
	
КонецФункции

Функция ЭтоКураторПользователя(ПроверяемыйКуратор, ПроверяемыйПользователь) Экспорт

	Если ПроверяемыйПользователь = ПроверяемыйКуратор Тогда
		Возврат Истина;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", ПроверяемыйПользователь);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦБР_ГруппыСотрудниковСостав.Ссылка.Руководитель КАК Руководитель
	|ИЗ
	|	Справочник.ЦБР_ГруппыСотрудников.Состав КАК ЦБР_ГруппыСотрудниковСостав
	|ГДЕ
	|	ЦБР_ГруппыСотрудниковСостав.Пользователь = &Пользователь";

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Руководитель) И Выборка.Руководитель = ПроверяемыйКуратор Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь; 
	
КонецФункции

#КонецОбласти

#КонецОбласти
